# -*- coding:utf-8 -*-

import numpy as np

if __name__ == '__main__':
    # stype = 'pca'
    # print stype

    # 协方差测试
    x = np.array([0.69, -1.31, 0.39, 0.09, 1.29, 0.49, 0.19, -0.81, -0.31, -0.71])
    y = np.array([0.49, -1.21, 0.99, 0.29, 1.09, 0.79, -0.31, -0.81, -0.31, -1.01])
    # x1 = [0.69, -1.31, 0.39, 0.09, 1.29, 0.49, 0.19, -0.81, -0.31, -0.71]
    # y1 = [0.49, -1.21, 0.99, 0.29, 1.09, 0.79, -0.31, -0.81, -0.31, -1.01]
    print x, x.shape
    print y, y.shape
    print np.cov(x, y)
    print np.cov(x1, y1)


